# YOLOv11s model configuration (custom 3-class version)

nc: 3  # number of classes
depth_multiple: 0.33  # model depth scaling
width_multiple: 0.50  # layer width scaling

backbone:
  [
    [-1, 1, Conv, [64, 3, 2]],      # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4
    [-1, 3, C2f, [128]],            # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8
    [-1, 6, C2f, [256]],            # 4
    [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16
    [-1, 6, C2f, [512]],            # 6
    [-1, 1, Conv, [1024, 3, 2]],    # 7-P5/32
    [-1, 3, C2f, [1024]],           # 8
    [-1, 1, SPPF, [1024, 5]],       # 9
  ]

head:
  [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],
    [-1, 3, C2f, [512]],

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C2f, [256]],

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C2f, [512]],

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 2], 1, Concat, [1]],
    [-1, 3, C2f, [1024]],

    [[10, 13, 16], 1, Detect, [nc]]  # P3, P4, P5
  ]

